"""
Привести два примера отношения "содержит" между классами, которое похоже на "является", но таковым не является.

1. Класс "Носитель данных" и его возможные наследники: жесткий диск, твердотельный накопитель, дискета, CD-RW.
Тогда в классе "Носитель данных" можно выделить поле "тип носителя" с возможными значениями "магнитный", "оптический", "флеш-память" и др.

2. Класс "Дом" и его возможные наследники: кирпичный дом, деревянный дом, дом из газоблока.
Тогда в классе "Дом" можно выделить поле "материал внешних стен" с возможными значениями "кирпич", "дерево", "газоблок" и др.
"""