"""
Привести примеры наследования подтипов, с ограничением и с расширением.

1. Наследование подтипов
Класс-родитель "Птица" и его потомки "глухарь", "гусь", "аист".
Все потомки отличаются от класса-родителя уникальными свойствами (в том числе от друг друга).

2. Наследование с ограничением
Класс-родитель "Переключатель" (тип меню), два потомка - "флажок" (checkbox) и "радиокнопка" (radio button).
Оба потомка используются в разных ситуациях, ограничивают класс-родитель.

3. Наследование с расширением
Класс-родитель структура данных "Очередь" (queue).
Расширяющим ее потомком будет структура данных "Дек" (deque). К операциям добавления в конец (действие для очереди) в деке добавляется операция добавления в начало.
"""
